SushiBits/platform-stm32l4/include/stm32l442xx_handler.h
/* This file is auto-generated using the IRQN tool. Do not modify. */

#ifndef IRQN_HANDLER

#include <stm32l4xx_it.h>

#else

IRQN_HANDLER(-14, NonMaskableInt)
IRQN_HANDLER(-13, HardFault)
IRQN_HANDLER(-12, MemoryManagement)
IRQN_HANDLER(-11, BusFault)
IRQN_HANDLER(-10, UsageFault)
SKIP_HANDLER(-9)
SKIP_HANDLER(-8)
SKIP_HANDLER(-7)
SKIP_HANDLER(-6)
IRQN_HANDLER(-5, SVCall)
IRQN_HANDLER(-4, DebugMonitor)
SKIP_HANDLER(-3)
IRQN_HANDLER(-2, PendSV)
IRQN_HANDLER(-1, SysTick)
IRQN_HANDLER(0, WWDG)
IRQN_HANDLER(1, PVD_PVM)
IRQN_HANDLER(2, TAMP_STAMP)
IRQN_HANDLER(3, RTC_WKUP)
IRQN_HANDLER(4, FLASH)
IRQN_HANDLER(5, RCC)
IRQN_HANDLER(6, EXTI0)
IRQN_HANDLER(7, EXTI1)
IRQN_HANDLER(8, EXTI2)
IRQN_HANDLER(9, EXTI3)
IRQN_HANDLER(10, EXTI4)
IRQN_HANDLER(11, DMA1_Channel1)
IRQN_HANDLER(12, DMA1_Channel2)
IRQN_HANDLER(13, DMA1_Channel3)
IRQN_HANDLER(14, DMA1_Channel4)
IRQN_HANDLER(15, DMA1_Channel5)
IRQN_HANDLER(16, DMA1_Channel6)
IRQN_HANDLER(17, DMA1_Channel7)
IRQN_HANDLER(18, ADC1)
IRQN_HANDLER(19, CAN1_TX)
IRQN_HANDLER(20, CAN1_RX0)
IRQN_HANDLER(21, CAN1_RX1)
IRQN_HANDLER(22, CAN1_SCE)
IRQN_HANDLER(23, EXTI9_5)
IRQN_HANDLER(24, TIM1_BRK_TIM15)
IRQN_HANDLER(25, TIM1_UP_TIM16)
IRQN_HANDLER(26, TIM1_TRG_COM)
IRQN_HANDLER(27, TIM1_CC)
IRQN_HANDLER(28, TIM2)
SKIP_HANDLER(29)
SKIP_HANDLER(30)
IRQN_HANDLER(31, I2C1_EV)
IRQN_HANDLER(32, I2C1_ER)
SKIP_HANDLER(33)
SKIP_HANDLER(34)
IRQN_HANDLER(35, SPI1)
SKIP_HANDLER(36)
IRQN_HANDLER(37, USART1)
IRQN_HANDLER(38, USART2)
SKIP_HANDLER(39)
IRQN_HANDLER(40, EXTI15_10)
IRQN_HANDLER(41, RTC_Alarm)
SKIP_HANDLER(42)
SKIP_HANDLER(43)
SKIP_HANDLER(44)
SKIP_HANDLER(45)
SKIP_HANDLER(46)
SKIP_HANDLER(47)
SKIP_HANDLER(48)
SKIP_HANDLER(49)
SKIP_HANDLER(50)
IRQN_HANDLER(51, SPI3)
SKIP_HANDLER(52)
SKIP_HANDLER(53)
IRQN_HANDLER(54, TIM6_DAC)
IRQN_HANDLER(55, TIM7)
IRQN_HANDLER(56, DMA2_Channel1)
IRQN_HANDLER(57, DMA2_Channel2)
IRQN_HANDLER(58, DMA2_Channel3)
IRQN_HANDLER(59, DMA2_Channel4)
IRQN_HANDLER(60, DMA2_Channel5)
SKIP_HANDLER(61)
SKIP_HANDLER(62)
SKIP_HANDLER(63)
IRQN_HANDLER(64, COMP)
IRQN_HANDLER(65, LPTIM1)
IRQN_HANDLER(66, LPTIM2)
IRQN_HANDLER(67, USB)
IRQN_HANDLER(68, DMA2_Channel6)
IRQN_HANDLER(69, DMA2_Channel7)
IRQN_HANDLER(70, LPUART1)
IRQN_HANDLER(71, QUADSPI)
IRQN_HANDLER(72, I2C3_EV)
IRQN_HANDLER(73, I2C3_ER)
IRQN_HANDLER(74, SAI1)
SKIP_HANDLER(75)
IRQN_HANDLER(76, SWPMI1)
IRQN_HANDLER(77, TSC)
SKIP_HANDLER(78)
IRQN_HANDLER(79, AES)
IRQN_HANDLER(80, RNG)
IRQN_HANDLER(81, FPU)
IRQN_HANDLER(82, CRS)

#endif

